Revit 2027 API
RebarShapeDefinitionByArc Properties
The RebarShapeDefinitionByArc type exposes the following members.
Properties
Name | Description
Complete |  Report whether the shape definition is fully constrained.
(Inherited from RebarShapeDefinition)
IsPlanar |  Reports whether the shape definition lies within a plane: false if a spiral, true in all other cases.
(Inherited from RebarShapeDefinition)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeDefinition)
Type |  Among those rebar shapes defined by an arc, specify which kind.
Top
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace